regtests/0271_doclit/test.out

=============== req
<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body
xmlns:awsns="http://soapaws/"
xmlns:wsa="http://net.def.com/wsa">
<wsa:getQueueStatusRequest/>
</soapenv:Body>
</soapenv:Envelope>
=============== rep
<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body
xmlns:wsa="http://net.def.com/wsa">
<wsa:getQueueStatusResponse>
<wsa:numberQueued>1</wsa:numberQueued>
<wsa:maximumQueueSize>16</wsa:maximumQueueSize>
</wsa:getQueueStatusResponse>
</soapenv:Body>
</soapenv:Envelope>
numberQueued     = 1
maximumQueueSize = 16
